inf_basics.tex
% Created 2021-09-05 Sun 15:20
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[russian, english]{babel}
\usepackage[T2A]{fontenc}
\author{Starovoytov Alexandr, Grechko Georgy}
\date{\textit{<2021-09-04 Sat 13:50>}}
\title{Informatics basics}
\hypersetup{
 pdfauthor={Starovoytov Alexandr, Grechko Georgy},
 pdftitle={Informatics basics},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\begin{itemize}
\item \href{https://stewkk.github.io/infbasics/inf\_basics.pdf}{Лекция в pdf формате}
\item \href{https://stewkk.github.io/infbasics/}{Лекция в виде сайта}
\item Преподаватель
\begin{itemize}
\item Коновалов Александр Владимирович
\item 89175404352
\item akonovalov@bmstu.ru
\item a.v.konovalov87@mail.ru
\end{itemize}
\end{itemize}
\section{лекция 1}
\label{sec:org40a6eaa}
\subsection{Основные понятия информатики}
\label{sec:org59e1f65}
\subsubsection{Данные}
\label{sec:org3137be6}
это представление фактов, понятий, инструкций в форме, приемлемой
для обмена, интерпретации или обработки человеком или с помощью
автоматических средств
\subsubsection{Алгоритм}
\label{sec:org6cc9671}
это конечная совокупность точно заданных правил решения прозвольного класса
задач или набор инструкций, описывающий порядок действий исполнителя для
решения некотрой задачи
\subsubsection{Свойства алгоритма:}
\label{sec:org3abb196}
\begin{enumerate}
\item Дискретность - 
делится на отдельные элементарные части, отвечающие за определенные действия.
\item Детерминированность - 
на одних и тех же входных данных - один и тот же результат.
\item Понятность - 
элементы алгоритма должны быть понятны исполнителю.
\item Завершаемость - 
если не завершается - то это вычислительный процесс.
\item Массовость - 
алгоритм пригоден для решения всех задач данного типа.
\item Результативность - 
указывает на наличие таких исходных данных, для которых реализуемый
по заданному алгоритму вычислительный процесс должен через конечное
число шагов остановиться и выдать искомый результат.
\end{enumerate}
\subsubsection{Компьютерная программа}
\label{sec:org982d235}
это алгоритм, записанный на некотором языке программирования
\subsubsection{Язык программирования}
\label{sec:org6f22345}
формальный язык, предназначенный для записи компьютерных программ
\subsubsection{Компьютер}
\label{sec:orge182c2d}
программно управляемое устройство для обработки информации
\subsubsection{Подпрограмма}
\label{sec:org73507ac}
некоторый именованный блок кода. \\
Вызывающая программа приостанавливается, управление передается
подпрограмме,
по завершению управление передается обратно
\subsubsection{Сопрограмма}
\label{sec:org5533e3b}
в отличие от подпрограммы работает поочередно с вызывающей программой.
При повторном вызове возобновит выполнение с момента, где остановилась
\subsection{Парадигмы программирования}
\label{sec:org89af360}
совокупность идей и понятий, определяющих стиль написания компьютерных
программ (подход к программированию). Это способ концептуализации,
определяющий организацию вычислений и структурирование работы, выполняемой
компьютером.
\subsubsection{Основные группы парадигм}
\label{sec:org1f91d2d}
\begin{enumerate}
\item Императивные
способ записи программ, в котором указывается последовательность
действий \\
основной признак - оператор присваивания (меняющий значение переменной)
\begin{enumerate}
\item Структурное программирование
программа является композицией блоков с одним входом и
одним выходом \\
(есть операторы ветвления и цикла, но нет goto)
\item Процедурное программирование
совокупность подпрограмм, где одни подпрограммы вызывают другие
\item Объектно-ориентированное
программа рассматривается как набор некоторых взаимодействующих
объектов. \\
Объект сочетает в себе данные и методы их обработки,
методы вызываются в ответ на сообщение: \\
посылаем сообщение объекту -> вызывает метод -> возвращает ответ \\
объекты объединяются в классы
\end{enumerate}
\item Декларативные
способ записи программ, в котором описывается взаимосвязь между
данными, описывается цель, но не последовательность шагов ее вычисления
\begin{enumerate}
\item Функциональное
алгоритм записывается как набор взаимосвязанных функций, функции
рассматриваются с математической точки зрения, \\
описывает взаимосвязь между данными и результатом
\begin{verbatim}
      x = f(y) + g(z);
\end{verbatim}
\item Логическое (Prolog + отчасти SQL)
алгоритм описывает взаимосвязь между понятиями. \\
Выполнение программы сводится к выполнению запросов
\end{enumerate}
\item Метапрограммирование
метаирония. Программа рассматривается как данные/объект для
другой программы
\begin{enumerate}
\item Программу пишут программы
Например: макросы, генераторы кода, шаблоны С++ (фигня нечитаемая
зачем он постоянно в руках часы крутит попит симпл димпл круче
нет попит симпл димпл попит симпл димпл маленький красивый
попит большой и милый)
\item Программа взаимодействует с вычислительной средой
Рефлексия или интроспекция - самоанализ. \\
Например, посмотреть поля и значения в объекте класса
\end{enumerate}
\end{enumerate}
\subsubsection{примеры}
\label{sec:orge588e30}
\begin{verbatim}
ИП: sort(array);
ФП: sorted_list = sort(list)
    sorted_list - константа, т.к. нет присваивания
ЛП: sort(unsorted, sorted)
\end{verbatim}
\subsection{язык Scheme}
\label{sec:org09ad711}
\subsubsection{информация о языке}
\label{sec:org09e8bd1}
Lisp 1950-е годы Джон МакКарти \\
LISt Processing \\
Scheme 1970-е годы Абельсон и Сассман \\
изучаем R5RS \\
современная редакция R7RS
\begin{itemize}
\item другие языки семейства LISP:
\begin{itemize}
\item Common Lisp
\item Clojure
\item Racket
\end{itemize}
\end{itemize}
\end{document}
